In [3]:
import pandas as pd

In [4]:
titanic = pd.read_csv("titanic.csv")

In [5]:
titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [6]:
type(titanic['age'])

pandas.core.series.Series

In [7]:
titanic['age'].equals(titanic.age)

True

In [8]:
age = titanic.age

In [9]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [10]:
age.tail

<bound method NDFrame.tail of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64>

In [11]:
age.dtype

dtype('float64')

In [12]:
age.shape

(891,)

In [13]:
len(age)

891

In [14]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [15]:
age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [16]:
age.to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

## ANALIZE NUMERICA

In [17]:
age.count() #quantos dados nao vazios tem nessa coluna

np.int64(714)

In [18]:
age.size # quantos dados incluindo dados vazios tem na tabela

891

In [19]:
len(age) # quantos dados incluindo dados vazios tem na tabela

891

In [20]:
age.sum(skipna = True)

np.float64(21205.17)

In [21]:
age.mean()

np.float64(29.69911764705882)

In [22]:
age.median()

np.float64(28.0)

In [23]:
age.std()

np.float64(14.526497332334042)

In [24]:
age.min()

np.float64(0.42)

In [25]:
age.max()

np.float64(80.0)

In [26]:
age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [27]:
len(age.unique())

89

In [28]:
age.nunique( dropna = False)

89

In [29]:
age.value_counts()

age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [30]:
age.value_counts(sort=False)

age
22.00    27
38.00    11
26.00    18
35.00    18
54.00     8
         ..
0.67      1
30.50     2
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [31]:
age.value_counts(dropna=True)

age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [32]:
age.value_counts( bins=5)

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: count, dtype: int64

In [33]:
age.value_counts(normalize=True)

age
24.00    0.042017
22.00    0.037815
18.00    0.036415
28.00    0.035014
30.00    0.035014
           ...
24.50    0.001401
0.67     0.001401
0.42     0.001401
34.50    0.001401
74.00    0.001401
Name: proportion, Length: 88, dtype: float64

In [34]:
age.value_counts( ascending=True, sort=True)

age
66.0     1
12.0     1
70.5     1
36.5     1
20.5     1
        ..
28.0    25
30.0    25
18.0    26
22.0    27
24.0    30
Name: count, Length: 88, dtype: int64

In [35]:
age.value_counts(dropna=True, sort=True, ascending=False, normalize=True, bins=5)

(16.336, 32.252]    0.388328
(32.252, 48.168]    0.210999
(0.339, 16.336]     0.112233
(48.168, 64.084]    0.077441
(64.084, 80.0]      0.012346
Name: proportion, dtype: float64

In [36]:
30/age.size

0.03367003367003367

In [37]:
age.value_counts(dropna=True, sort=True, ascending=False, normalize=True, bins=5).sum()

np.float64(0.8013468013468015)

In [38]:
df = pd.read_csv("titanic.csv")
fare = df['fare'].value_counts(sort=True)

In [39]:
fare.idxmax() # mostra o indice com valores mais altos, que corresponde no caso, ao mais comum na tabela

np.float64(8.05)

In [47]:
pd.read_csv("summer.csv", usecols=['Athlete'])

                         Athlete
0                  HAJOS, Alfred
1               HERSCHMANN, Otto
2              DRIVAS, Dimitrios
3             MALOKINIS, Ioannis
4             CHASAPIS, Spiridon
...                          ...
31160         JANIKOWSKI, Damian
31161  REZAEI, Ghasem Gholamreza
31162             TOTROV, Rustam
31163          ALEKSANYAN, Artur
31164             LIDBERG, Jimmy

[31165 rows x 1 columns]

In [49]:
pd.Series([10,25,6,36,2])

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [53]:
pd.Series([10,25,6,36,2,20], index=['mon','tue','wed','thu','fri', 'sat'], name='Sales')

mon    10
tue    25
wed     6
thu    36
fri     2
sat    20
Name: Sales, dtype: int64

In [55]:
import numpy as np

In [56]:
sales = np.array([10,25,6,36,2])
sales

array([10, 25,  6, 36,  2])

In [57]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [58]:
sales = (10,25,6,36,2)

In [60]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [62]:
dic = {"MON" : 30, "TUE": 25, "WED":6, "THU":36 ,"FRI":2}
dic

{'MON': 30, 'TUE': 25, 'WED': 6, 'THU': 36, 'FRI': 2}

In [64]:
sales = pd.Series(dic)

In [65]:
sales

MON    30
TUE    25
WED     6
THU    36
FRI     2
dtype: int64

In [67]:
pd.Series(dic, index=[1,2,3,4,5])

1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

In [68]:
titanic = pd.read_csv("titanic.csv")

In [69]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]